[
    {
        "id":1,
        "image":"https://static.toiimg.com/thumb/msid-112728210,imgsize-31086,width-400,resizemode-4/112728210.jpg",
        "title":"India vs Bangladesh: When Virat Kohli broke the records of Don Bradman and Rahul Dravid",
        "content":"Virat Kohli showed exceptional form from 2016 to 2018, scoring over 1000 runs each year in Test cricket. In 2017, he set records by hitting his fourth consecutive double century in a series, outdoing Don Bradman and Rahul Dravid. His stellar performance led India to victory against Bangladesh in their first Test on Indian soil.",
        "category":"sports"
    },
    {
        "id":2,
        "image":"https://images.indianexpress.com/2024/08/WhatsApp-Image-2024-08-20-at-4.47.30-PM.jpeg?w=640",
        "title":"Abhishek absent at Mamatas protest march, TMC spliton Kolkata rape-murder evident",
        "content":"The divisions are aligned along the faultlines the TMC has already been grappling with over the rise of Mamatas nephew Abhishek Banerjee as TMCs No.2. Now, as the Mamata government faces heat over its handling of the Kolkata hospital rape and murder case  with the Supreme Court adding its weight to it on Tuesday one of those seen as keeping his distance is Abhishek.",
        "category":"politics"
    },
    {
        "id":3,
        "image":"https://images.indianexpress.com/2024/08/cover_495a84.jpg?w=640",
        "title":"RBI Governor ranked among top 3 global central bankers; Modi lauds Shaktikanta Das",
        "content":"Reserve Bank of India (RBI) Governor Shaktikanta Das has been ranked among the top three central bankers globally for the second consecutive year by the US-based magazine Global Finance.",
        "category":"business"
    },
    {
        "id":4,
        "image":"https://images.indianexpress.com/2024/07/Robert.jpg?resize=600,338",
        "title":"Know how a secret meeting led Robert Downey Jr. return to Marvel as Doctor Doom",
        "content":"In an interview to The Hollywood Reporters Awards Chatter Podcast, Downey recounted a meeting with Feige, where the Marvel president expressed his intent to “get Victor Von Doom right” and discussed strategies to both meet and exceed fan expectations.",
        "category":"entertainment"
    },
    {
        "id":5,
        "image":"https://static.toiimg.com/thumb/resizemode-4,msid-112686976,imgsize-22740,width-720/112686976.jpg",
        "title":"Capture every beat: OPPO F27 5Gs Music Party Planner and Holo Audio redefine party experience",
        "content":"Theres something truly special about party evenings. Whether its the vibrant energy, the laughter shared with friends, or the sheer joy of the moment, parties are where memories are made and celebrated. From the lively chatter and the music beats to the snapshots that capture these unforgettable moments, every element contributes to the magic of the night. Amidst all this, having the right companion like the OPPO F27 5G can make all the difference.",
        "category":"tech"
    },
    {
        "id":6,
        "image":"https://c.ndtvimg.com/2024-08/65ivi1lg_kolkata-doctor-protest_625x300_13_August_24.jpg?im=FeatureCrop,algorithm=dnn,width=650,height=400",
        "title":"What Happened, Please Tell Chilling Calls To Kolkata Doctor's Parents",
        "content":"The rape and murder of the Kolkata doctor has shaken the country and sparked massive protests Kolkata: It was just another morning at the middle class household in north Kolkata. The daughter who had made her parents proud by becoming a doctor and was studying further was at RG Kar Medical College and Hospital for a long shift. Around 11.30 pm the previous night she had called her mother and spoken to her as always ",
        "category":"politics"
    },
    {
        "id":7,
        "image":"https://images.indianexpress.com/2024/08/Afghanistan-pitch-Noida.jpg?w=640",
        "title":"Sheetal Devi Finishes At Second Spot In Compound Open Ranking With Personal Best Score",
        "content":"Sheetal Devi Finishes At Second Spot In Compound Open Ranking With Personal Best Score",
        "category":"sports"
    },
    {
        "id":8,
        "image":"https://images.indianexpress.com/2024/08/Rashid-Khan-2.jpg?w=640",
        "title":"India Star Announces Retirement Afghanistans Rashid Khan to take a break from Test cricket",
        "content":"Left-arm fast bowler Barinder Sran, who played six ODIs and two T20Is for India in 2016, has announced retirement from all forms of the game. In all, he picked 13 wickets while representing India in both white-ball formats. Sran holds the record for the best T20I figures by an Indian male cricketer on his debut. He achieved the same against Zimbabwe on June 20, 2016, where he picked up a four-wicket haul by giving away just ten runs.",
        "category":"sports"
    },
    {
        "id":9,
        "image":"https://images.indianexpress.com/2024/08/Zverev-writer.jpg?w=640",
        "title":"A tennis writer turns to crowdfunding for legal costs after World No.4 Alexander Zverev files a lawsuit",
        "content":"Four years on from the revelations of domestic abuse from Olga Sharypova, an ex-girlfriend of World No. 4 tennis player Alexander Zverev, the journalist that covered her story has had to crowd-fund the legal fees to fight off a lawsuit from the German",
        "category":"sports"
    },
    {
        "id":10,
        "image":"https://images.indianexpress.com/2024/05/Ronaldo-Euros.jpg?w=640",
        "title":"Cristiano Ronaldo to be honored by UEFA as all-time top goalscorer during Champions League draw ceremony",
        "content":"Cristiano Ronaldo: Five-time Ballon Dor winner, Cristiano Ronaldo is set to receive a special award at the UEFA Champions League draw ceremony on Thursday in Monaco. The 39-year-old Portuguese will be honored with the all-time top goalscorer award for Europe’s top club competition.",
        "category":"sports"
    },
    {
        "id":11,
        "image":"https://images.indianexpress.com/2024/08/Avani-2.jpg?w=640",
        "title":"India at Paris 2024 Paralympics: Who are India's top medal contenders? An analysis of 7 podium prospects",
        "content":"Hopes are high for the Indian contingent at the Paris Paralympics to deliver their best-ever showing at the Games, with the benchmark set in Tokyo. Three years back, India finished the Tokyo Paralympics with 19 medals including five gold, eight silver, and six bronze. As has been the case at these Games, para athletics is where once again India’s highest percentage of medals would be expected in Paris as well.",
        "category":"sports"
    },
    {
         "id":12,
         "image":"https://images.indianexpress.com/2024/08/siddhant.jpg?w=640",
          "title":"Yudhra trailer: Siddhant Chaturvedi plays a man with anger issues on a mission to kill a drug lord; Raghav Juyal returns in a negative role",
          "content":"The trailer for Siddhant Chaturvedi’s much-anticipated film Yudhra was released on Thursday. The film is produced by Farhan Akhtar and Ritesh Sidhwani under their banner Excel Entertainment. Siddhant made his Bollywood debut with Zoya’s 2019 film Gully Boy. In Yudhra, the actor portrays a character with anger issues who is thrust into a mission to eliminate a drug lord",
           "category":"entertainment"
    },{
        "id":13,
        "image":"https://images.indianexpress.com/2024/08/priyanka-necklace.jpg?w=640",
        "title":"Priyanka Chopra on the struggles she faced while shooting The Bluff: ‘My days were really intense…worked 12 hours’",
        "content":"Priyanka Chopra recently wrapped up the shoot for her Hollywood film The Bluff. Directed by Frank E Flowers, the movie also stars Karl Urban in the lead role. During the shooting, Priyanka shared several BTS photos giving a glimpse of her work, injuries and sets, which were far away from her family and friends",
        "category":"entertainment"
    },{
        "id":14,
        "image":"https://images.indianexpress.com/2023/06/WhatsApp-Image-2023-06-18-at-7.35.50-PM.jpeg?w=640",
        "title":"Adipurush director Om Raut boasts about box office collections, defends Prabhas as a ‘flop-proof’ star: ‘There was planning to pan the film’",
        "content":"Filmmaker Om Raut, who faced the wrath of the devout audience after the release of the film Adipurush, has defended it in a new interview. He said that the movie was a victim of false perception, and that it has actually made quite an impressive sum of money at the box office. Based on the Ramayana, Adipurush starred Prabhas, Kriti Sanon, Sunny Singh, and Saif Ali Khan as versions of Lord Rama, Sita, Lakshman, and Raavan.",
        "category":"entertainment"
    },{
        "id":15,
        "image":"https://images.indianexpress.com/2024/02/iron-man-10022024.jpg?w=640",
        "title":"Robert Downey Jr’s audition tape for Iron Man goes viral ahead of his debut as Doctor Doom. Watch",
        "content":"Robert Downey Jr is all set to return to the MCU as the villain Doctor Doom. Amid the buzz, an old video tape of RDJ’s audition for his popular role of Iron Man has resurfaced online. In the viral video, the actor can be seen clad in a suit effortlessly delivering his lines as Tony Stark for a screen test.",
        "category":"entertainment"
    },{
        "id":16,
        "image":"https://images.indianexpress.com/2024/08/khan.jpg?w=640",
        "title":"Salman Khan lends his voice to nephew Ayaan Agnihotri’s new track ‘You Are Mine’",
        "content":"Salman Khan has teamed up with his nephew Ayaan Agnihotri—the son of Atul and Alvira Agnihotri—for a song titled “You Are Mine”. In addition to featuring in the music video, Salman has lent his voice to the track and also co-wrote the song’s lyrics with Sanjeev Chaturvedi. Ayaan appears in the video as a rapper, showcasing his musical talents",
        "category":"entertainment"
    },{
        "id":17,
        "image":"https://images.indianexpress.com/2024/08/azad-dushyant.jpeg?w=640",
        "title":"JJP ties up with Bhim Army as all parties eye the formidable Dalit vote in Haryana",
        "content":"WITH ALL the main political parties in Haryana trying to woo the Dalit vote bank in the state, which stands at a substantial 21% of the population, the Jannayak Janata Party (JJP) Tuesday unveiled an alliance with Chandrashekhar Azad’s Azad Samaj Party (Kanshi Ram).",
        "category":"politics"
    },{
        "id":18,
        "image":"https://images.indianexpress.com/2024/08/Kavitha.jpg?w=640",
        "title":"Decode Politics: As K Kavitha gets bail, a look at the case against her, what SC said",
        "content":"The Supreme Court on Tuesday granted bail to Bharat Rashtra Samithi (BRS) MLC K Kavitha in the Central Bureau of Investigation (CBI) and Enforcement Directorate (ED) cases linked to the alleged liquor policy scam, setting aside a July 1 order of the Delhi High Court denying her bail.",
        "category":"politics"
    },{
        "id":19,
        "image":"https://images.indianexpress.com/2024/08/G-parmeshwara.jpg?w=640",
        "title":"Congress’s pride of place to Parameshwara sets off new CM buzz in Karnataka again",
        "content":"A WEEK ago, amidst the political crisis in Karnataka following Governor Thaawarchand Gehlot’s sanction to prosecute Chief Minister Siddaramaiah in an alleged land scam, national general secretary Randeep Surjewala beckoned state Home Minister Dr G Parameshwara to the front row at a press briefing in Delhi.",
        "category":"politics"
    },{
        "id":20,
        "image":"https://images.indianexpress.com/2024/08/rajesh-chaudhary-akhilesh-yadav.jpg?w=640",
        "title":"The BJP MLA whose remarks saw Akhilesh spring to Mayawati ‘defence’ is rising Jat face of west UP",
        "content":"Spokesperson, organisational man, vocal supporter of party issues, troubleshooter and “giant killer” are some of the many hats that Mant MLA Rajesh Chaudhary has donned over his decades-long political career.",
        "category":"politics"
    },{
        "id":21,
        "image":"https://images.indianexpress.com/2024/08/share-market-1.jpg?w=640",
        "title":"To catch the IPO boom, law firms race to scale up capital markets practices",
        "content":"On August 9, Ola Electric Mobility became the first purely electric vehicle company in India to list its shares on the stock exchange after floating an initial public offering (IPO). Spearheading the process behind the scenes were two Indian corporate law firms, Cyril Amarchand Mangaldas (CAM) and Shardul Amarchand Mangaldas (SAM) — who advised Ola Electric and the bankers, respectively.",
        "category":"business"
    },{
        "id":22,
        "image":"https://images.indianexpress.com/2024/08/loksabha-2024-08-26T072031.812.jpg?w=640",
        "title":"‘Solar module shortlist key for local industry to take off; prices will change over time’: Waaree Energies CEO Amit Paithankar",
        "content":"Waaree Energies Ltd, India’s largest producer of solar PV modules, holds over 10.7 GW or 21.3 per cent of the total capacity enlisted in the government’s shortlist of domestic producers.In a conversation with Aggam Walia, Amit Paithankar, CEO of Waaree Energies, defended the reimposition of the Approved List of Models and Manufacturers (ALMM) order, which restricts the use of foreign modules in most solar projects.",
        "category":"business"
    },{
        "id":23,
        "image":"https://images.indianexpress.com/2024/08/investment-7591.jpg?w=640",
        "title":"Financial sector sees Rs 23,000 crore pull out by FPIs on credit-deposit gap concerns",
        "content":"The financial services sector witnessed outflows to the tune of Rs 23,000 crore by foreign portfolio investors (FPIs) between July 16 and August 15, according to National Securities Depository Ltd (NSDL) data.",
        "category":"business"
    },{
        "id":24,
        "image":"https://images.indianexpress.com/2024/08/aa.png?w=640",
        "title":"Anil Ambani on Sebi order: Reviewing various options, will take appropriate action",
        "content":"Industrialist Anil Ambani is exploring legal options after the Securities and Exchange Board of India (Sebi) banned him from the stock market for five years and imposed a fine of Rs 25 crore, a statement from his spokesperson said.",
        "category":"business"
    },{
        "id":25,
        "image":"https://images.indianexpress.com/2024/08/exports-759.jpg?w=640",
        "title":"https://images.indianexpress.com/2024/08/exports-759.jpg?w=640",
        "content":"Driven primarily by electrical machinery and parts, India’s imports from Vietnam are on an upward trajectory, with a 17 percent increase to $5.8 billion between January and July this year, compared to the same period last year, according to an analysis of Ministry of Commerce and Industry data.",
        "category":"business"
    },{
        "id":26,
        "image":"https://images.indianexpress.com/2024/03/instagram-1600.jpg?w=640",
        "title":"Instagram launches online training hub to help amateur creators gain more followers",
        "content":"On August 29, Instagram said that it is launching an educational resource platform for aspiring influencers and content creators called the Creator Lab. “Creator Lab will contain content from creators, who share their experiences and insights, including what they wish they had known when they started and what they have learned through trial and error,” the company said in a press release.",
        "category":"tech"
    },{
        "id":27,
        "image":"https://images.indianexpress.com/2024/08/Tech-feature-images43.jpg?w=640",
        "title":"Midjourney eyes hardware debut amid wave of AI-enabled devices",
        "content":"Midjourney is stepping into the electronics industry as the AI company recently announced that it is looking to assemble a new team for building hardware in San Francisco, US.“We’re officially getting into hardware,” Midjourney wrote in a post on X dated Wednesday, August 28. ",
        "category":"tech"
    },{
        "id":28,
        "image":"https://images.indianexpress.com/2024/08/jiobrain.jpg?w=640",
        "title":"Reliance AGM 2024: Company announces JioBrain, an AI service platform",
        "content":"At its 47th AGM, Reliance unveiled JioBrain, a new AI service platform that promises to offer powerful generative AI models at the most affordable prices, according to Chairman Mukesh Ambani. The company also announced plans to build a “truly national AI infrastructure” and “gigawatt-scale AI-ready data centres” in Jamnagar, powered by Reliance’s green energy.",
        "category":"tech"
    },{
        "id":29,
        "image":"https://images.indianexpress.com/2024/06/ai-iphone.jpg?w=640",
        "title":"iOS 18.1 beta introduces Clean Up, an AI-powered image-editing tool similar to Google’s Magic Editor",
        "content":"Apple has introduced a new AI-powered image-editing tool called Clean Up, which allows users to remove unwanted objects from photos. This feature works like Google’s Magic Editor, a tool available for free on both Android and iOS devices via the Google Photos app.",
        "category":"tech"
    },{
        "id":30,
        "image":"https://images.indianexpress.com/2024/08/vs_df2193.png?w=640",
        "title":"From budget to premium: 5 smartwatches that can endure outdoor adventures",
        "content":"Like smartphones, smartwatches have gotten a lot cheaper. While most modern smartwatches can easily handle dust and water, they might not function properly in extreme conditions. If you are an outdoor enthusiast looking to buy a new smartwatch that can handle whatever you throw at it, here are some of the best options available.",
        "category":"tech"
    }
   
   
   

   
   
   
   
   
   
   
]